apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_uart.h
/****************************************************************************
 * arch/risc-v/src/esp32c6/hardware/esp32c6_uart.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_RISCV_SRC_ESP32C6_HARDWARE_ESP32C6_UART_H
#define __ARCH_RISCV_SRC_ESP32C6_HARDWARE_ESP32C6_UART_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32c6_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* UART_FIFO_REG register
 * FIFO data register
 */

#define UART_FIFO_REG(i) (REG_UART_BASE(i) + 0x0)

/* UART_RXFIFO_RD_BYTE : RO; bitpos: [7:0]; default: 0;
 * UART $n accesses FIFO via this register.
 */

#define UART_RXFIFO_RD_BYTE    0x000000ff
#define UART_RXFIFO_RD_BYTE_M  (UART_RXFIFO_RD_BYTE_V << UART_RXFIFO_RD_BYTE_S)
#define UART_RXFIFO_RD_BYTE_V  0x000000ff
#define UART_RXFIFO_RD_BYTE_S  0

/* UART_INT_RAW_REG register
 * Raw interrupt status
 */

#define UART_INT_RAW_REG(i) (REG_UART_BASE(i) + 0x4)

/* UART_WAKEUP_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 * This interrupt raw bit turns to high level when input rxd edge changes
 * more times than what reg_active_threshold specifies in light sleeping
 * mode.
 */

#define UART_WAKEUP_INT_RAW    (BIT(19))
#define UART_WAKEUP_INT_RAW_M  (UART_WAKEUP_INT_RAW_V << UART_WAKEUP_INT_RAW_S)
#define UART_WAKEUP_INT_RAW_V  0x00000001
#define UART_WAKEUP_INT_RAW_S  19

/* UART_AT_CMD_CHAR_DET_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects the
 * configured at_cmd char.
 */

#define UART_AT_CMD_CHAR_DET_INT_RAW    (BIT(18))
#define UART_AT_CMD_CHAR_DET_INT_RAW_M  (UART_AT_CMD_CHAR_DET_INT_RAW_V << UART_AT_CMD_CHAR_DET_INT_RAW_S)
#define UART_AT_CMD_CHAR_DET_INT_RAW_V  0x00000001
#define UART_AT_CMD_CHAR_DET_INT_RAW_S  18

/* UART_RS485_CLASH_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 * This interrupt raw bit turns to high level when detects a clash between
 * transmitter and receiver in rs485 mode.
 */

#define UART_RS485_CLASH_INT_RAW    (BIT(17))
#define UART_RS485_CLASH_INT_RAW_M  (UART_RS485_CLASH_INT_RAW_V << UART_RS485_CLASH_INT_RAW_S)
#define UART_RS485_CLASH_INT_RAW_V  0x00000001
#define UART_RS485_CLASH_INT_RAW_S  17

/* UART_RS485_FRM_ERR_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects a data
 * frame error from the echo of transmitter in rs485 mode.
 */

#define UART_RS485_FRM_ERR_INT_RAW    (BIT(16))
#define UART_RS485_FRM_ERR_INT_RAW_M  (UART_RS485_FRM_ERR_INT_RAW_V << UART_RS485_FRM_ERR_INT_RAW_S)
#define UART_RS485_FRM_ERR_INT_RAW_V  0x00000001
#define UART_RS485_FRM_ERR_INT_RAW_S  16

/* UART_RS485_PARITY_ERR_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects a parity
 * error from the echo of transmitter in rs485 mode.
 */

#define UART_RS485_PARITY_ERR_INT_RAW    (BIT(15))
#define UART_RS485_PARITY_ERR_INT_RAW_M  (UART_RS485_PARITY_ERR_INT_RAW_V << UART_RS485_PARITY_ERR_INT_RAW_S)
#define UART_RS485_PARITY_ERR_INT_RAW_V  0x00000001
#define UART_RS485_PARITY_ERR_INT_RAW_S  15

/* UART_TX_DONE_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 * This interrupt raw bit turns to high level when transmitter has send out
 * all data in FIFO.
 */

#define UART_TX_DONE_INT_RAW    (BIT(14))
#define UART_TX_DONE_INT_RAW_M  (UART_TX_DONE_INT_RAW_V << UART_TX_DONE_INT_RAW_S)
#define UART_TX_DONE_INT_RAW_V  0x00000001
#define UART_TX_DONE_INT_RAW_S  14

/* UART_TX_BRK_IDLE_DONE_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 * This interrupt raw bit turns to high level when transmitter has kept the
 * shortest duration after sending the  last data.
 */

#define UART_TX_BRK_IDLE_DONE_INT_RAW    (BIT(13))
#define UART_TX_BRK_IDLE_DONE_INT_RAW_M  (UART_TX_BRK_IDLE_DONE_INT_RAW_V << UART_TX_BRK_IDLE_DONE_INT_RAW_S)
#define UART_TX_BRK_IDLE_DONE_INT_RAW_V  0x00000001
#define UART_TX_BRK_IDLE_DONE_INT_RAW_S  13

/* UART_TX_BRK_DONE_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 * This interrupt raw bit turns to high level when transmitter completes
 * sending  NULL characters after all data in Tx-FIFO are sent.
 */

#define UART_TX_BRK_DONE_INT_RAW    (BIT(12))
#define UART_TX_BRK_DONE_INT_RAW_M  (UART_TX_BRK_DONE_INT_RAW_V << UART_TX_BRK_DONE_INT_RAW_S)
#define UART_TX_BRK_DONE_INT_RAW_V  0x00000001
#define UART_TX_BRK_DONE_INT_RAW_S  12

/* UART_GLITCH_DET_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects a glitch
 * in the middle of a start bit.
 */

#define UART_GLITCH_DET_INT_RAW    (BIT(11))
#define UART_GLITCH_DET_INT_RAW_M  (UART_GLITCH_DET_INT_RAW_V << UART_GLITCH_DET_INT_RAW_S)
#define UART_GLITCH_DET_INT_RAW_V  0x00000001
#define UART_GLITCH_DET_INT_RAW_S  11

/* UART_SW_XOFF_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 * This interrupt raw bit turns to high level when receiver receives Xoff
 * char when uart_sw_flow_con_en is set to 1.
 */

#define UART_SW_XOFF_INT_RAW    (BIT(10))
#define UART_SW_XOFF_INT_RAW_M  (UART_SW_XOFF_INT_RAW_V << UART_SW_XOFF_INT_RAW_S)
#define UART_SW_XOFF_INT_RAW_V  0x00000001
#define UART_SW_XOFF_INT_RAW_S  10

