apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_uart.h
#define UART_RX_FILT_REG(i) (REG_UART_BASE(i) + 0x18)

/* UART_GLITCH_FILT_EN : R/W; bitpos: [8]; default: 0;
 * Set this bit to enable Rx signal filter.
 */

#define UART_GLITCH_FILT_EN    (BIT(8))
#define UART_GLITCH_FILT_EN_M  (UART_GLITCH_FILT_EN_V << UART_GLITCH_FILT_EN_S)
#define UART_GLITCH_FILT_EN_V  0x00000001
#define UART_GLITCH_FILT_EN_S  8

/* UART_GLITCH_FILT : R/W; bitpos: [7:0]; default: 8;
 * when input pulse width is lower than this value the pulse is ignored.
 */

#define UART_GLITCH_FILT    0x000000ff
#define UART_GLITCH_FILT_M  (UART_GLITCH_FILT_V << UART_GLITCH_FILT_S)
#define UART_GLITCH_FILT_V  0x000000ff
#define UART_GLITCH_FILT_S  0

/* UART_STATUS_REG register
 * UART status register
 */

#define UART_STATUS_REG(i) (REG_UART_BASE(i) + 0x1c)

/* UART_TXD : RO; bitpos: [31]; default: 1;
 * This bit represents the  level of the internal uart txd signal.
 */

#define UART_TXD    (BIT(31))
#define UART_TXD_M  (UART_TXD_V << UART_TXD_S)
#define UART_TXD_V  0x00000001
#define UART_TXD_S  31

/* UART_RTSN : RO; bitpos: [30]; default: 1;
 * This bit represents the level of the internal uart rts signal.
 */

#define UART_RTSN    (BIT(30))
#define UART_RTSN_M  (UART_RTSN_V << UART_RTSN_S)
#define UART_RTSN_V  0x00000001
#define UART_RTSN_S  30

/* UART_DTRN : RO; bitpos: [29]; default: 1;
 * This bit represents the level of the internal uart dtr signal.
 */

#define UART_DTRN    (BIT(29))
#define UART_DTRN_M  (UART_DTRN_V << UART_DTRN_S)
#define UART_DTRN_V  0x00000001
#define UART_DTRN_S  29

/* UART_TXFIFO_CNT : RO; bitpos: [23:16]; default: 0;
 * Stores the byte number of data in Tx-FIFO.
 */

#define UART_TXFIFO_CNT    0x000000ff
#define UART_TXFIFO_CNT_M  (UART_TXFIFO_CNT_V << UART_TXFIFO_CNT_S)
#define UART_TXFIFO_CNT_V  0x000000ff
#define UART_TXFIFO_CNT_S  16

/* UART_RXD : RO; bitpos: [15]; default: 1;
 * This register represent the  level value of the internal uart rxd signal.
 */

#define UART_RXD    (BIT(15))
#define UART_RXD_M  (UART_RXD_V << UART_RXD_S)
#define UART_RXD_V  0x00000001
#define UART_RXD_S  15

/* UART_CTSN : RO; bitpos: [14]; default: 1;
 * This register represent the level value of the internal uart cts signal.
 */

#define UART_CTSN    (BIT(14))
#define UART_CTSN_M  (UART_CTSN_V << UART_CTSN_S)
#define UART_CTSN_V  0x00000001
#define UART_CTSN_S  14

/* UART_DSRN : RO; bitpos: [13]; default: 0;
 * The register represent the level value of the internal uart dsr signal.
 */

#define UART_DSRN    (BIT(13))
#define UART_DSRN_M  (UART_DSRN_V << UART_DSRN_S)
#define UART_DSRN_V  0x00000001
#define UART_DSRN_S  13

/* UART_RXFIFO_CNT : RO; bitpos: [7:0]; default: 0;
 * Stores the byte number of valid data in Rx-FIFO.
 */

#define UART_RXFIFO_CNT    0x000000ff
#define UART_RXFIFO_CNT_M  (UART_RXFIFO_CNT_V << UART_RXFIFO_CNT_S)
#define UART_RXFIFO_CNT_V  0x000000ff
#define UART_RXFIFO_CNT_S  0

/* UART_CONF0_SYNC_REG register
 * a
 */

#define UART_CONF0_SYNC_REG(i) (REG_UART_BASE(i) + 0x20)

/* UART_TXFIFO_RST : R/W; bitpos: [23]; default: 0;
 * Set this bit to reset the uart transmit-FIFO.
 */

#define UART_TXFIFO_RST    (BIT(23))
#define UART_TXFIFO_RST_M  (UART_TXFIFO_RST_V << UART_TXFIFO_RST_S)
#define UART_TXFIFO_RST_V  0x00000001
#define UART_TXFIFO_RST_S  23

/* UART_RXFIFO_RST : R/W; bitpos: [22]; default: 0;
 * Set this bit to reset the uart receive-FIFO.
 */

#define UART_RXFIFO_RST    (BIT(22))
#define UART_RXFIFO_RST_M  (UART_RXFIFO_RST_V << UART_RXFIFO_RST_S)
#define UART_RXFIFO_RST_V  0x00000001
#define UART_RXFIFO_RST_S  22

/* UART_SW_RTS : R/W; bitpos: [21]; default: 0;
 * This register is used to configure the software rts signal which is used
 * in software flow control.
 */

#define UART_SW_RTS    (BIT(21))
#define UART_SW_RTS_M  (UART_SW_RTS_V << UART_SW_RTS_S)
#define UART_SW_RTS_V  0x00000001
#define UART_SW_RTS_S  21

/* UART_MEM_CLK_EN : R/W; bitpos: [20]; default: 1;
 * UART memory clock gate enable signal.
 */

#define UART_MEM_CLK_EN    (BIT(20))
#define UART_MEM_CLK_EN_M  (UART_MEM_CLK_EN_V << UART_MEM_CLK_EN_S)
#define UART_MEM_CLK_EN_V  0x00000001
#define UART_MEM_CLK_EN_S  20

/* UART_AUTOBAUD_EN : R/W; bitpos: [19]; default: 0;
 * This is the enable bit for detecting baudrate.
 */

#define UART_AUTOBAUD_EN    (BIT(19))
#define UART_AUTOBAUD_EN_M  (UART_AUTOBAUD_EN_V << UART_AUTOBAUD_EN_S)
#define UART_AUTOBAUD_EN_V  0x00000001
#define UART_AUTOBAUD_EN_S  19

/* UART_ERR_WR_MASK : R/W; bitpos: [18]; default: 0;
 * 1'h1: Receiver stops storing data into FIFO when data is wrong. 1'h0:
 * Receiver stores the data even if the  received data is wrong.
 */

#define UART_ERR_WR_MASK    (BIT(18))
#define UART_ERR_WR_MASK_M  (UART_ERR_WR_MASK_V << UART_ERR_WR_MASK_S)
#define UART_ERR_WR_MASK_V  0x00000001
#define UART_ERR_WR_MASK_S  18

/* UART_DIS_RX_DAT_OVF : R/W; bitpos: [17]; default: 0;
 * Disable UART Rx data overflow detect.
 */

#define UART_DIS_RX_DAT_OVF    (BIT(17))
#define UART_DIS_RX_DAT_OVF_M  (UART_DIS_RX_DAT_OVF_V << UART_DIS_RX_DAT_OVF_S)
#define UART_DIS_RX_DAT_OVF_V  0x00000001
#define UART_DIS_RX_DAT_OVF_S  17

/* UART_TXD_INV : R/W; bitpos: [16]; default: 0;
 * Set this bit to inverse the level value of uart txd signal.
 */

#define UART_TXD_INV    (BIT(16))
#define UART_TXD_INV_M  (UART_TXD_INV_V << UART_TXD_INV_S)
#define UART_TXD_INV_V  0x00000001
#define UART_TXD_INV_S  16

/* UART_RXD_INV : R/W; bitpos: [15]; default: 0;
 * Set this bit to inverse the level value of uart rxd signal.
 */

#define UART_RXD_INV    (BIT(15))
#define UART_RXD_INV_M  (UART_RXD_INV_V << UART_RXD_INV_S)
#define UART_RXD_INV_V  0x00000001
#define UART_RXD_INV_S  15

/* UART_IRDA_EN : R/W; bitpos: [14]; default: 0;
 * Set this bit to enable IrDA protocol.
 */

#define UART_IRDA_EN    (BIT(14))
#define UART_IRDA_EN_M  (UART_IRDA_EN_V << UART_IRDA_EN_S)
#define UART_IRDA_EN_V  0x00000001
#define UART_IRDA_EN_S  14

/* UART_TX_FLOW_EN : R/W; bitpos: [13]; default: 0;
 * Set this bit to enable flow control function for transmitter.
 */

#define UART_TX_FLOW_EN    (BIT(13))
#define UART_TX_FLOW_EN_M  (UART_TX_FLOW_EN_V << UART_TX_FLOW_EN_S)
#define UART_TX_FLOW_EN_V  0x00000001
#define UART_TX_FLOW_EN_S  13

/* UART_LOOPBACK : R/W; bitpos: [12]; default: 0;
 * Set this bit to enable uart loopback test mode.
 */

#define UART_LOOPBACK    (BIT(12))
#define UART_LOOPBACK_M  (UART_LOOPBACK_V << UART_LOOPBACK_S)
#define UART_LOOPBACK_V  0x00000001
#define UART_LOOPBACK_S  12

/* UART_IRDA_RX_INV : R/W; bitpos: [11]; default: 0;
 * Set this bit to invert the level of IrDA receiver.
 */

#define UART_IRDA_RX_INV    (BIT(11))
#define UART_IRDA_RX_INV_M  (UART_IRDA_RX_INV_V << UART_IRDA_RX_INV_S)
#define UART_IRDA_RX_INV_V  0x00000001
#define UART_IRDA_RX_INV_S  11

/* UART_IRDA_TX_INV : R/W; bitpos: [10]; default: 0;
 * Set this bit to invert the level of  IrDA transmitter.
 */

#define UART_IRDA_TX_INV    (BIT(10))
#define UART_IRDA_TX_INV_M  (UART_IRDA_TX_INV_V << UART_IRDA_TX_INV_S)
#define UART_IRDA_TX_INV_V  0x00000001
#define UART_IRDA_TX_INV_S  10

/* UART_IRDA_WCTL : R/W; bitpos: [9]; default: 0;
 * 1'h1: The IrDA transmitter's 11th bit is the same as 10th bit. 1'h0: Set
 * IrDA transmitter's 11th bit to 0.
 */

#define UART_IRDA_WCTL    (BIT(9))
#define UART_IRDA_WCTL_M  (UART_IRDA_WCTL_V << UART_IRDA_WCTL_S)
#define UART_IRDA_WCTL_V  0x00000001
#define UART_IRDA_WCTL_S  9

