apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_uart.h
/* UART_IRDA_TX_EN : R/W; bitpos: [8]; default: 0;
 * This is the start enable bit for IrDA transmitter.
 */

#define UART_IRDA_TX_EN    (BIT(8))
#define UART_IRDA_TX_EN_M  (UART_IRDA_TX_EN_V << UART_IRDA_TX_EN_S)
#define UART_IRDA_TX_EN_V  0x00000001
#define UART_IRDA_TX_EN_S  8

/* UART_IRDA_DPLX : R/W; bitpos: [7]; default: 0;
 * Set this bit to enable IrDA loopback mode.
 */

#define UART_IRDA_DPLX    (BIT(7))
#define UART_IRDA_DPLX_M  (UART_IRDA_DPLX_V << UART_IRDA_DPLX_S)
#define UART_IRDA_DPLX_V  0x00000001
#define UART_IRDA_DPLX_S  7

/* UART_TXD_BRK : R/W; bitpos: [6]; default: 0;
 * Set this bit to enbale transmitter to  send NULL when the process of
 * sending data is done.
 */

#define UART_TXD_BRK    (BIT(6))
#define UART_TXD_BRK_M  (UART_TXD_BRK_V << UART_TXD_BRK_S)
#define UART_TXD_BRK_V  0x00000001
#define UART_TXD_BRK_S  6

/* UART_STOP_BIT_NUM : R/W; bitpos: [5:4]; default: 1;
 * This register is used to set the length of  stop bit.
 */

#define UART_STOP_BIT_NUM    0x00000003
#define UART_STOP_BIT_NUM_M  (UART_STOP_BIT_NUM_V << UART_STOP_BIT_NUM_S)
#define UART_STOP_BIT_NUM_V  0x00000003
#define UART_STOP_BIT_NUM_S  4

/* UART_BIT_NUM : R/W; bitpos: [3:2]; default: 3;
 * This register is used to set the length of data.
 */

#define UART_BIT_NUM    0x00000003
#define UART_BIT_NUM_M  (UART_BIT_NUM_V << UART_BIT_NUM_S)
#define UART_BIT_NUM_V  0x00000003
#define UART_BIT_NUM_S  2

/* UART_PARITY_EN : R/W; bitpos: [1]; default: 0;
 * Set this bit to enable uart parity check.
 */

#define UART_PARITY_EN    (BIT(1))
#define UART_PARITY_EN_M  (UART_PARITY_EN_V << UART_PARITY_EN_S)
#define UART_PARITY_EN_V  0x00000001
#define UART_PARITY_EN_S  1

/* UART_PARITY : R/W; bitpos: [0]; default: 0;
 * This register is used to configure the parity check mode.
 */

#define UART_PARITY    (BIT(0))
#define UART_PARITY_M  (UART_PARITY_V << UART_PARITY_S)
#define UART_PARITY_V  0x00000001
#define UART_PARITY_S  0

/* UART_CONF1_REG register
 * Configuration register 1
 */

#define UART_CONF1_REG(i) (REG_UART_BASE(i) + 0x24)

/* UART_CLK_EN : R/W; bitpos: [21]; default: 0;
 * 1'h1: Force clock on for register. 1'h0: Support clock only when
 * application writes registers.
 */

#define UART_CLK_EN    (BIT(21))
#define UART_CLK_EN_M  (UART_CLK_EN_V << UART_CLK_EN_S)
#define UART_CLK_EN_V  0x00000001
#define UART_CLK_EN_S  21

/* UART_SW_DTR : R/W; bitpos: [20]; default: 0;
 * This register is used to configure the software dtr signal which is used
 * in software flow control.
 */

#define UART_SW_DTR    (BIT(20))
#define UART_SW_DTR_M  (UART_SW_DTR_V << UART_SW_DTR_S)
#define UART_SW_DTR_V  0x00000001
#define UART_SW_DTR_S  20

/* UART_DTR_INV : R/W; bitpos: [19]; default: 0;
 * Set this bit to inverse the level value of uart dtr signal.
 */

#define UART_DTR_INV    (BIT(19))
#define UART_DTR_INV_M  (UART_DTR_INV_V << UART_DTR_INV_S)
#define UART_DTR_INV_V  0x00000001
#define UART_DTR_INV_S  19

/* UART_RTS_INV : R/W; bitpos: [18]; default: 0;
 * Set this bit to inverse the level value of uart rts signal.
 */

#define UART_RTS_INV    (BIT(18))
#define UART_RTS_INV_M  (UART_RTS_INV_V << UART_RTS_INV_S)
#define UART_RTS_INV_V  0x00000001
#define UART_RTS_INV_S  18

/* UART_DSR_INV : R/W; bitpos: [17]; default: 0;
 * Set this bit to inverse the level value of uart dsr signal.
 */

#define UART_DSR_INV    (BIT(17))
#define UART_DSR_INV_M  (UART_DSR_INV_V << UART_DSR_INV_S)
#define UART_DSR_INV_V  0x00000001
#define UART_DSR_INV_S  17

/* UART_CTS_INV : R/W; bitpos: [16]; default: 0;
 * Set this bit to inverse the level value of uart cts signal.
 */

#define UART_CTS_INV    (BIT(16))
#define UART_CTS_INV_M  (UART_CTS_INV_V << UART_CTS_INV_S)
#define UART_CTS_INV_V  0x00000001
#define UART_CTS_INV_S  16

/* UART_TXFIFO_EMPTY_THRHD : R/W; bitpos: [15:8]; default: 96;
 * It will produce txfifo_empty_int interrupt when the data amount in
 * Tx-FIFO is less than this register value.
 */

#define UART_TXFIFO_EMPTY_THRHD    0x000000ff
#define UART_TXFIFO_EMPTY_THRHD_M  (UART_TXFIFO_EMPTY_THRHD_V << UART_TXFIFO_EMPTY_THRHD_S)
#define UART_TXFIFO_EMPTY_THRHD_V  0x000000ff
#define UART_TXFIFO_EMPTY_THRHD_S  8

/* UART_RXFIFO_FULL_THRHD : R/W; bitpos: [7:0]; default: 96;
 * It will produce rxfifo_full_int interrupt when receiver receives more
 * data than this register value.
 */

#define UART_RXFIFO_FULL_THRHD    0x000000ff
#define UART_RXFIFO_FULL_THRHD_M  (UART_RXFIFO_FULL_THRHD_V << UART_RXFIFO_FULL_THRHD_S)
#define UART_RXFIFO_FULL_THRHD_V  0x000000ff
#define UART_RXFIFO_FULL_THRHD_S  0

/* UART_HWFC_CONF_SYNC_REG register
 * Hardware flow-control configuration
 */

#define UART_HWFC_CONF_SYNC_REG(i) (REG_UART_BASE(i) + 0x2c)

/* UART_RX_FLOW_EN : R/W; bitpos: [8]; default: 0;
 * This is the flow enable bit for UART receiver.
 */

#define UART_RX_FLOW_EN    (BIT(8))
#define UART_RX_FLOW_EN_M  (UART_RX_FLOW_EN_V << UART_RX_FLOW_EN_S)
#define UART_RX_FLOW_EN_V  0x00000001
#define UART_RX_FLOW_EN_S  8

/* UART_RX_FLOW_THRHD : R/W; bitpos: [7:0]; default: 0;
 * This register is used to configure the maximum amount of data that can be
 * received  when hardware flow control works.
 */

#define UART_RX_FLOW_THRHD    0x000000ff
#define UART_RX_FLOW_THRHD_M  (UART_RX_FLOW_THRHD_V << UART_RX_FLOW_THRHD_S)
#define UART_RX_FLOW_THRHD_V  0x000000ff
#define UART_RX_FLOW_THRHD_S  0

/* UART_SLEEP_CONF0_REG register
 * UART sleep configure register 0
 */

#define UART_SLEEP_CONF0_REG(i) (REG_UART_BASE(i) + 0x30)

/* UART_WK_CHAR4 : R/W; bitpos: [31:24]; default: 0;
 * This register restores the specified wake up char4 to wake up
 */

#define UART_WK_CHAR4    0x000000ff
#define UART_WK_CHAR4_M  (UART_WK_CHAR4_V << UART_WK_CHAR4_S)
#define UART_WK_CHAR4_V  0x000000ff
#define UART_WK_CHAR4_S  24

/* UART_WK_CHAR3 : R/W; bitpos: [23:16]; default: 0;
 * This register restores the specified wake up char3 to wake up
 */

#define UART_WK_CHAR3    0x000000ff
#define UART_WK_CHAR3_M  (UART_WK_CHAR3_V << UART_WK_CHAR3_S)
#define UART_WK_CHAR3_V  0x000000ff
#define UART_WK_CHAR3_S  16

/* UART_WK_CHAR2 : R/W; bitpos: [15:8]; default: 0;
 * This register restores the specified wake up char2 to wake up
 */

#define UART_WK_CHAR2    0x000000ff
#define UART_WK_CHAR2_M  (UART_WK_CHAR2_V << UART_WK_CHAR2_S)
#define UART_WK_CHAR2_V  0x000000ff
#define UART_WK_CHAR2_S  8

/* UART_WK_CHAR1 : R/W; bitpos: [7:0]; default: 0;
 * This register restores the specified wake up char1 to wake up
 */

#define UART_WK_CHAR1    0x000000ff
#define UART_WK_CHAR1_M  (UART_WK_CHAR1_V << UART_WK_CHAR1_S)
#define UART_WK_CHAR1_V  0x000000ff
#define UART_WK_CHAR1_S  0

/* UART_SLEEP_CONF1_REG register
 * UART sleep configure register 1
 */

#define UART_SLEEP_CONF1_REG(i) (REG_UART_BASE(i) + 0x34)

/* UART_WK_CHAR0 : R/W; bitpos: [7:0]; default: 0;
 * This register restores the specified char0 to wake up
 */

#define UART_WK_CHAR0    0x000000ff
#define UART_WK_CHAR0_M  (UART_WK_CHAR0_V << UART_WK_CHAR0_S)
#define UART_WK_CHAR0_V  0x000000ff
#define UART_WK_CHAR0_S  0

