apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_uart.h
/* UART_SLEEP_CONF2_REG register
 * UART sleep configure register 2
 */

#define UART_SLEEP_CONF2_REG(i) (REG_UART_BASE(i) + 0x38)

/* UART_WK_MODE_SEL : R/W; bitpos: [27:26]; default: 0;
 * This register is used to select wake up mode. 0: RXD toggling to wake up.
 * 1: received data number larger than
 */

#define UART_WK_MODE_SEL    0x00000003
#define UART_WK_MODE_SEL_M  (UART_WK_MODE_SEL_V << UART_WK_MODE_SEL_S)
#define UART_WK_MODE_SEL_V  0x00000003
#define UART_WK_MODE_SEL_S  26

/* UART_WK_CHAR_MASK : R/W; bitpos: [25:21]; default: 0;
 * This register is used to mask  wake up char.
 */

#define UART_WK_CHAR_MASK    0x0000001f
#define UART_WK_CHAR_MASK_M  (UART_WK_CHAR_MASK_V << UART_WK_CHAR_MASK_S)
#define UART_WK_CHAR_MASK_V  0x0000001f
#define UART_WK_CHAR_MASK_S  21

/* UART_WK_CHAR_NUM : R/W; bitpos: [20:18]; default: 5;
 * This register is used to select number of wake up char.
 */

#define UART_WK_CHAR_NUM    0x00000007
#define UART_WK_CHAR_NUM_M  (UART_WK_CHAR_NUM_V << UART_WK_CHAR_NUM_S)
#define UART_WK_CHAR_NUM_V  0x00000007
#define UART_WK_CHAR_NUM_S  18

/* UART_RX_WAKE_UP_THRHD : R/W; bitpos: [17:10]; default: 1;
 * In wake up mode 1 this field is used to set the received data number
 * threshold to wake up chip.
 */

#define UART_RX_WAKE_UP_THRHD    0x000000ff
#define UART_RX_WAKE_UP_THRHD_M  (UART_RX_WAKE_UP_THRHD_V << UART_RX_WAKE_UP_THRHD_S)
#define UART_RX_WAKE_UP_THRHD_V  0x000000ff
#define UART_RX_WAKE_UP_THRHD_S  10

/* UART_ACTIVE_THRESHOLD : R/W; bitpos: [9:0]; default: 240;
 * The uart is activated from light sleeping mode when the input rxd edge
 * changes more times than this register value.
 */

#define UART_ACTIVE_THRESHOLD    0x000003ff
#define UART_ACTIVE_THRESHOLD_M  (UART_ACTIVE_THRESHOLD_V << UART_ACTIVE_THRESHOLD_S)
#define UART_ACTIVE_THRESHOLD_V  0x000003ff
#define UART_ACTIVE_THRESHOLD_S  0

/* UART_SWFC_CONF0_SYNC_REG register
 * Software flow-control character configuration
 */

#define UART_SWFC_CONF0_SYNC_REG(i) (REG_UART_BASE(i) + 0x3c)

/* UART_SEND_XOFF : R/W/SS/SC; bitpos: [22]; default: 0;
 * Set this bit to send Xoff char. It is cleared by hardware automatically.
 */

#define UART_SEND_XOFF    (BIT(22))
#define UART_SEND_XOFF_M  (UART_SEND_XOFF_V << UART_SEND_XOFF_S)
#define UART_SEND_XOFF_V  0x00000001
#define UART_SEND_XOFF_S  22

/* UART_SEND_XON : R/W/SS/SC; bitpos: [21]; default: 0;
 * Set this bit to send Xon char. It is cleared by hardware automatically.
 */

#define UART_SEND_XON    (BIT(21))
#define UART_SEND_XON_M  (UART_SEND_XON_V << UART_SEND_XON_S)
#define UART_SEND_XON_V  0x00000001
#define UART_SEND_XON_S  21

/* UART_FORCE_XOFF : R/W; bitpos: [20]; default: 0;
 * Set this bit to stop the  transmitter from sending data.
 */

#define UART_FORCE_XOFF    (BIT(20))
#define UART_FORCE_XOFF_M  (UART_FORCE_XOFF_V << UART_FORCE_XOFF_S)
#define UART_FORCE_XOFF_V  0x00000001
#define UART_FORCE_XOFF_S  20

/* UART_FORCE_XON : R/W; bitpos: [19]; default: 0;
 * Set this bit to enable the transmitter to go on sending data.
 */

#define UART_FORCE_XON    (BIT(19))
#define UART_FORCE_XON_M  (UART_FORCE_XON_V << UART_FORCE_XON_S)
#define UART_FORCE_XON_V  0x00000001
#define UART_FORCE_XON_S  19

/* UART_XONOFF_DEL : R/W; bitpos: [18]; default: 0;
 * Set this bit to remove flow control char from the received data.
 */

#define UART_XONOFF_DEL    (BIT(18))
#define UART_XONOFF_DEL_M  (UART_XONOFF_DEL_V << UART_XONOFF_DEL_S)
#define UART_XONOFF_DEL_V  0x00000001
#define UART_XONOFF_DEL_S  18

/* UART_SW_FLOW_CON_EN : R/W; bitpos: [17]; default: 0;
 * Set this bit to enable software flow control. It is used with register
 * sw_xon or sw_xoff.
 */

#define UART_SW_FLOW_CON_EN    (BIT(17))
#define UART_SW_FLOW_CON_EN_M  (UART_SW_FLOW_CON_EN_V << UART_SW_FLOW_CON_EN_S)
#define UART_SW_FLOW_CON_EN_V  0x00000001
#define UART_SW_FLOW_CON_EN_S  17

/* UART_XON_XOFF_STILL_SEND : R/W; bitpos: [16]; default: 0;
 * In software flow control mode, UART Tx is disabled once UART Rx receives
 * XOFF. In this status, UART Tx can not transmit XOFF even the received
 * data number is larger than UART_XOFF_THRESHOLD. Set this bit to enable
 * UART Tx can transmit XON/XOFF when UART Tx is disabled.
 */

#define UART_XON_XOFF_STILL_SEND    (BIT(16))
#define UART_XON_XOFF_STILL_SEND_M  (UART_XON_XOFF_STILL_SEND_V << UART_XON_XOFF_STILL_SEND_S)
#define UART_XON_XOFF_STILL_SEND_V  0x00000001
#define UART_XON_XOFF_STILL_SEND_S  16

/* UART_XOFF_CHAR : R/W; bitpos: [15:8]; default: 19;
 * This register stores the Xoff flow control char.
 */

#define UART_XOFF_CHAR    0x000000ff
#define UART_XOFF_CHAR_M  (UART_XOFF_CHAR_V << UART_XOFF_CHAR_S)
#define UART_XOFF_CHAR_V  0x000000ff
#define UART_XOFF_CHAR_S  8

/* UART_XON_CHAR : R/W; bitpos: [7:0]; default: 17;
 * This register stores the Xon flow control char.
 */

#define UART_XON_CHAR    0x000000ff
#define UART_XON_CHAR_M  (UART_XON_CHAR_V << UART_XON_CHAR_S)
#define UART_XON_CHAR_V  0x000000ff
#define UART_XON_CHAR_S  0

/* UART_SWFC_CONF1_REG register
 * Software flow-control character configuration
 */

#define UART_SWFC_CONF1_REG(i) (REG_UART_BASE(i) + 0x40)

/* UART_XOFF_THRESHOLD : R/W; bitpos: [15:8]; default: 224;
 * When the data amount in Rx-FIFO is more than this register value with
 * uart_sw_flow_con_en set to 1  it will send a Xoff char.
 */

#define UART_XOFF_THRESHOLD    0x000000ff
#define UART_XOFF_THRESHOLD_M  (UART_XOFF_THRESHOLD_V << UART_XOFF_THRESHOLD_S)
#define UART_XOFF_THRESHOLD_V  0x000000ff
#define UART_XOFF_THRESHOLD_S  8

/* UART_XON_THRESHOLD : R/W; bitpos: [7:0]; default: 0;
 * When the data amount in Rx-FIFO is less than this register value with
 * uart_sw_flow_con_en set to 1  it will send a Xon char.
 */

#define UART_XON_THRESHOLD    0x000000ff
#define UART_XON_THRESHOLD_M  (UART_XON_THRESHOLD_V << UART_XON_THRESHOLD_S)
#define UART_XON_THRESHOLD_V  0x000000ff
#define UART_XON_THRESHOLD_S  0

/* UART_TXBRK_CONF_SYNC_REG register
 * Tx Break character configuration
 */

#define UART_TXBRK_CONF_SYNC_REG(i) (REG_UART_BASE(i) + 0x44)

/* UART_TX_BRK_NUM : R/W; bitpos: [7:0]; default: 10;
 * This register is used to configure the number of 0 to be sent after the
 * process of sending data is done. It is active when txd_brk is set to 1.
 */

#define UART_TX_BRK_NUM    0x000000ff
#define UART_TX_BRK_NUM_M  (UART_TX_BRK_NUM_V << UART_TX_BRK_NUM_S)
#define UART_TX_BRK_NUM_V  0x000000ff
#define UART_TX_BRK_NUM_S  0

/* UART_IDLE_CONF_SYNC_REG register
 * Frame-end idle configuration
 */

#define UART_IDLE_CONF_SYNC_REG(i) (REG_UART_BASE(i) + 0x48)

/* UART_TX_IDLE_NUM : R/W; bitpos: [19:10]; default: 256;
 * This register is used to configure the duration time between transfers.
 */

