apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_uart.h
#define UART_TX_IDLE_NUM    0x000003ff
#define UART_TX_IDLE_NUM_M  (UART_TX_IDLE_NUM_V << UART_TX_IDLE_NUM_S)
#define UART_TX_IDLE_NUM_V  0x000003ff
#define UART_TX_IDLE_NUM_S  10

/* UART_RX_IDLE_THRHD : R/W; bitpos: [9:0]; default: 256;
 * It will produce frame end signal when receiver takes more time to receive
 * one byte data than this register value.
 */

#define UART_RX_IDLE_THRHD    0x000003ff
#define UART_RX_IDLE_THRHD_M  (UART_RX_IDLE_THRHD_V << UART_RX_IDLE_THRHD_S)
#define UART_RX_IDLE_THRHD_V  0x000003ff
#define UART_RX_IDLE_THRHD_S  0

/* UART_RS485_CONF_SYNC_REG register
 * RS485 mode configuration
 */

#define UART_RS485_CONF_SYNC_REG(i) (REG_UART_BASE(i) + 0x4c)

/* UART_RS485_TX_DLY_NUM : R/W; bitpos: [9:6]; default: 0;
 * This register is used to delay the transmitter's internal data signal.
 */

#define UART_RS485_TX_DLY_NUM    0x0000000f
#define UART_RS485_TX_DLY_NUM_M  (UART_RS485_TX_DLY_NUM_V << UART_RS485_TX_DLY_NUM_S)
#define UART_RS485_TX_DLY_NUM_V  0x0000000f
#define UART_RS485_TX_DLY_NUM_S  6

/* UART_RS485_RX_DLY_NUM : R/W; bitpos: [5]; default: 0;
 * This register is used to delay the receiver's internal data signal.
 */

#define UART_RS485_RX_DLY_NUM    (BIT(5))
#define UART_RS485_RX_DLY_NUM_M  (UART_RS485_RX_DLY_NUM_V << UART_RS485_RX_DLY_NUM_S)
#define UART_RS485_RX_DLY_NUM_V  0x00000001
#define UART_RS485_RX_DLY_NUM_S  5

/* UART_RS485RXBY_TX_EN : R/W; bitpos: [4]; default: 0;
 * 1'h1: enable rs485 transmitter to send data when rs485 receiver line is
 * busy.
 */

#define UART_RS485RXBY_TX_EN    (BIT(4))
#define UART_RS485RXBY_TX_EN_M  (UART_RS485RXBY_TX_EN_V << UART_RS485RXBY_TX_EN_S)
#define UART_RS485RXBY_TX_EN_V  0x00000001
#define UART_RS485RXBY_TX_EN_S  4

/* UART_RS485TX_RX_EN : R/W; bitpos: [3]; default: 0;
 * Set this bit to enable receiver could receive data when the transmitter
 * is transmitting data in rs485 mode.
 */

#define UART_RS485TX_RX_EN    (BIT(3))
#define UART_RS485TX_RX_EN_M  (UART_RS485TX_RX_EN_V << UART_RS485TX_RX_EN_S)
#define UART_RS485TX_RX_EN_V  0x00000001
#define UART_RS485TX_RX_EN_S  3

/* UART_DL1_EN : R/W; bitpos: [2]; default: 0;
 * Set this bit to delay the stop bit by 1 bit.
 */

#define UART_DL1_EN    (BIT(2))
#define UART_DL1_EN_M  (UART_DL1_EN_V << UART_DL1_EN_S)
#define UART_DL1_EN_V  0x00000001
#define UART_DL1_EN_S  2

/* UART_DL0_EN : R/W; bitpos: [1]; default: 0;
 * Set this bit to delay the stop bit by 1 bit.
 */

#define UART_DL0_EN    (BIT(1))
#define UART_DL0_EN_M  (UART_DL0_EN_V << UART_DL0_EN_S)
#define UART_DL0_EN_V  0x00000001
#define UART_DL0_EN_S  1

/* UART_RS485_EN : R/W; bitpos: [0]; default: 0;
 * Set this bit to choose the rs485 mode.
 */

#define UART_RS485_EN    (BIT(0))
#define UART_RS485_EN_M  (UART_RS485_EN_V << UART_RS485_EN_S)
#define UART_RS485_EN_V  0x00000001
#define UART_RS485_EN_S  0

/* UART_AT_CMD_PRECNT_SYNC_REG register
 * Pre-sequence timing configuration
 */

#define UART_AT_CMD_PRECNT_SYNC_REG(i) (REG_UART_BASE(i) + 0x50)

/* UART_PRE_IDLE_NUM : R/W; bitpos: [15:0]; default: 2305;
 * This register is used to configure the idle duration time before the
 * first at_cmd is received by receiver.
 */

#define UART_PRE_IDLE_NUM    0x0000ffff
#define UART_PRE_IDLE_NUM_M  (UART_PRE_IDLE_NUM_V << UART_PRE_IDLE_NUM_S)
#define UART_PRE_IDLE_NUM_V  0x0000ffff
#define UART_PRE_IDLE_NUM_S  0

/* UART_AT_CMD_POSTCNT_SYNC_REG register
 * Post-sequence timing configuration
 */

#define UART_AT_CMD_POSTCNT_SYNC_REG(i) (REG_UART_BASE(i) + 0x54)

/* UART_POST_IDLE_NUM : R/W; bitpos: [15:0]; default: 2305;
 * This register is used to configure the duration time between the last
 * at_cmd and the next data.
 */

#define UART_POST_IDLE_NUM    0x0000ffff
#define UART_POST_IDLE_NUM_M  (UART_POST_IDLE_NUM_V << UART_POST_IDLE_NUM_S)
#define UART_POST_IDLE_NUM_V  0x0000ffff
#define UART_POST_IDLE_NUM_S  0

/* UART_AT_CMD_GAPTOUT_SYNC_REG register
 * Timeout configuration
 */

#define UART_AT_CMD_GAPTOUT_SYNC_REG(i) (REG_UART_BASE(i) + 0x58)

/* UART_RX_GAP_TOUT : R/W; bitpos: [15:0]; default: 11;
 * This register is used to configure the duration time between the at_cmd
 * chars.
 */

#define UART_RX_GAP_TOUT    0x0000ffff
#define UART_RX_GAP_TOUT_M  (UART_RX_GAP_TOUT_V << UART_RX_GAP_TOUT_S)
#define UART_RX_GAP_TOUT_V  0x0000ffff
#define UART_RX_GAP_TOUT_S  0

/* UART_AT_CMD_CHAR_SYNC_REG register
 * AT escape sequence detection configuration
 */

#define UART_AT_CMD_CHAR_SYNC_REG(i) (REG_UART_BASE(i) + 0x5c)

/* UART_CHAR_NUM : R/W; bitpos: [15:8]; default: 3;
 * This register is used to configure the num of continuous at_cmd chars
 * received by receiver.
 */

#define UART_CHAR_NUM    0x000000ff
#define UART_CHAR_NUM_M  (UART_CHAR_NUM_V << UART_CHAR_NUM_S)
#define UART_CHAR_NUM_V  0x000000ff
#define UART_CHAR_NUM_S  8

/* UART_AT_CMD_CHAR : R/W; bitpos: [7:0]; default: 43;
 * This register is used to configure the content of at_cmd char.
 */

#define UART_AT_CMD_CHAR    0x000000ff
#define UART_AT_CMD_CHAR_M  (UART_AT_CMD_CHAR_V << UART_AT_CMD_CHAR_S)
#define UART_AT_CMD_CHAR_V  0x000000ff
#define UART_AT_CMD_CHAR_S  0

/* UART_MEM_CONF_REG register
 * UART memory power configuration
 */

#define UART_MEM_CONF_REG(i) (REG_UART_BASE(i) + 0x60)

/* UART_MEM_FORCE_PU : R/W; bitpos: [26]; default: 0;
 * Set this bit to force power up UART memory.
 */

#define UART_MEM_FORCE_PU    (BIT(26))
#define UART_MEM_FORCE_PU_M  (UART_MEM_FORCE_PU_V << UART_MEM_FORCE_PU_S)
#define UART_MEM_FORCE_PU_V  0x00000001
#define UART_MEM_FORCE_PU_S  26

/* UART_MEM_FORCE_PD : R/W; bitpos: [25]; default: 0;
 * Set this bit to force power down UART memory.
 */

#define UART_MEM_FORCE_PD    (BIT(25))
#define UART_MEM_FORCE_PD_M  (UART_MEM_FORCE_PD_V << UART_MEM_FORCE_PD_S)
#define UART_MEM_FORCE_PD_V  0x00000001
#define UART_MEM_FORCE_PD_S  25

/* UART_TOUT_CONF_SYNC_REG register
 * UART threshold and allocation configuration
 */

#define UART_TOUT_CONF_SYNC_REG(i) (REG_UART_BASE(i) + 0x64)

/* UART_RX_TOUT_THRHD : R/W; bitpos: [11:2]; default: 10;
 * This register is used to configure the threshold time that receiver takes
 * to receive one byte. The rxfifo_tout_int interrupt will be trigger when
 * the receiver takes more time to receive one byte with rx_tout_en set to 1.
 */

