apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_uart.h
#define UART_RX_TOUT_THRHD    0x000003ff
#define UART_RX_TOUT_THRHD_M  (UART_RX_TOUT_THRHD_V << UART_RX_TOUT_THRHD_S)
#define UART_RX_TOUT_THRHD_V  0x000003ff
#define UART_RX_TOUT_THRHD_S  2

/* UART_RX_TOUT_FLOW_DIS : R/W; bitpos: [1]; default: 0;
 * Set this bit to stop accumulating idle_cnt when hardware flow control
 * works.
 */

#define UART_RX_TOUT_FLOW_DIS    (BIT(1))
#define UART_RX_TOUT_FLOW_DIS_M  (UART_RX_TOUT_FLOW_DIS_V << UART_RX_TOUT_FLOW_DIS_S)
#define UART_RX_TOUT_FLOW_DIS_V  0x00000001
#define UART_RX_TOUT_FLOW_DIS_S  1

/* UART_RX_TOUT_EN : R/W; bitpos: [0]; default: 0;
 * This is the enble bit for uart receiver's timeout function.
 */

#define UART_RX_TOUT_EN    (BIT(0))
#define UART_RX_TOUT_EN_M  (UART_RX_TOUT_EN_V << UART_RX_TOUT_EN_S)
#define UART_RX_TOUT_EN_V  0x00000001
#define UART_RX_TOUT_EN_S  0

/* UART_MEM_TX_STATUS_REG register
 * Tx-SRAM write and read offset address.
 */

#define UART_MEM_TX_STATUS_REG(i) (REG_UART_BASE(i) + 0x68)

/* UART_TX_SRAM_RADDR : RO; bitpos: [16:9]; default: 0;
 * This register stores the offset read address in Tx-SRAM.
 */

#define UART_TX_SRAM_RADDR    0x000000ff
#define UART_TX_SRAM_RADDR_M  (UART_TX_SRAM_RADDR_V << UART_TX_SRAM_RADDR_S)
#define UART_TX_SRAM_RADDR_V  0x000000ff
#define UART_TX_SRAM_RADDR_S  9

/* UART_TX_SRAM_WADDR : RO; bitpos: [7:0]; default: 0;
 * This register stores the offset write address in Tx-SRAM.
 */

#define UART_TX_SRAM_WADDR    0x000000ff
#define UART_TX_SRAM_WADDR_M  (UART_TX_SRAM_WADDR_V << UART_TX_SRAM_WADDR_S)
#define UART_TX_SRAM_WADDR_V  0x000000ff
#define UART_TX_SRAM_WADDR_S  0

/* UART_MEM_RX_STATUS_REG register
 * Rx-SRAM write and read offset address.
 */

#define UART_MEM_RX_STATUS_REG(i) (REG_UART_BASE(i) + 0x6c)

/* UART_RX_SRAM_WADDR : RO; bitpos: [16:9]; default: 128;
 * This register stores the offset write address in Rx-SRAM.
 */

#define UART_RX_SRAM_WADDR    0x000000ff
#define UART_RX_SRAM_WADDR_M  (UART_RX_SRAM_WADDR_V << UART_RX_SRAM_WADDR_S)
#define UART_RX_SRAM_WADDR_V  0x000000ff
#define UART_RX_SRAM_WADDR_S  9

/* UART_RX_SRAM_RADDR : RO; bitpos: [7:0]; default: 128;
 * This register stores the offset read address in RX-SRAM.
 */

#define UART_RX_SRAM_RADDR    0x000000ff
#define UART_RX_SRAM_RADDR_M  (UART_RX_SRAM_RADDR_V << UART_RX_SRAM_RADDR_S)
#define UART_RX_SRAM_RADDR_V  0x000000ff
#define UART_RX_SRAM_RADDR_S  0

/* UART_FSM_STATUS_REG register
 * UART transmit and receive status.
 */

#define UART_FSM_STATUS_REG(i) (REG_UART_BASE(i) + 0x70)

/* UART_ST_UTX_OUT : RO; bitpos: [7:4]; default: 0;
 * This is the status register of transmitter.
 */

#define UART_ST_UTX_OUT    0x0000000f
#define UART_ST_UTX_OUT_M  (UART_ST_UTX_OUT_V << UART_ST_UTX_OUT_S)
#define UART_ST_UTX_OUT_V  0x0000000f
#define UART_ST_UTX_OUT_S  4

/* UART_ST_URX_OUT : RO; bitpos: [3:0]; default: 0;
 * This is the status register of receiver.
 */

#define UART_ST_URX_OUT    0x0000000f
#define UART_ST_URX_OUT_M  (UART_ST_URX_OUT_V << UART_ST_URX_OUT_S)
#define UART_ST_URX_OUT_V  0x0000000f
#define UART_ST_URX_OUT_S  0

/* UART_POSPULSE_REG register
 * Autobaud high pulse register
 */

#define UART_POSPULSE_REG(i) (REG_UART_BASE(i) + 0x74)

/* UART_POSEDGE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 * This register stores the minimal input clock count between two positive
 * edges. It is used in boudrate-detect process.
 */

#define UART_POSEDGE_MIN_CNT    0x00000fff
#define UART_POSEDGE_MIN_CNT_M  (UART_POSEDGE_MIN_CNT_V << UART_POSEDGE_MIN_CNT_S)
#define UART_POSEDGE_MIN_CNT_V  0x00000fff
#define UART_POSEDGE_MIN_CNT_S  0

/* UART_NEGPULSE_REG register
 * Autobaud low pulse register
 */

#define UART_NEGPULSE_REG(i) (REG_UART_BASE(i) + 0x78)

/* UART_NEGEDGE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 * This register stores the minimal input clock count between two negative
 * edges. It is used in boudrate-detect process.
 */

#define UART_NEGEDGE_MIN_CNT    0x00000fff
#define UART_NEGEDGE_MIN_CNT_M  (UART_NEGEDGE_MIN_CNT_V << UART_NEGEDGE_MIN_CNT_S)
#define UART_NEGEDGE_MIN_CNT_V  0x00000fff
#define UART_NEGEDGE_MIN_CNT_S  0

/* UART_LOWPULSE_REG register
 * Autobaud minimum low pulse duration register
 */

#define UART_LOWPULSE_REG(i) (REG_UART_BASE(i) + 0x7c)

/* UART_LOWPULSE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 * This register stores the value of the minimum duration time of the low
 * level pulse. It is used in baud rate-detect process.
 */

#define UART_LOWPULSE_MIN_CNT    0x00000fff
#define UART_LOWPULSE_MIN_CNT_M  (UART_LOWPULSE_MIN_CNT_V << UART_LOWPULSE_MIN_CNT_S)
#define UART_LOWPULSE_MIN_CNT_V  0x00000fff
#define UART_LOWPULSE_MIN_CNT_S  0

/* UART_HIGHPULSE_REG register
 * Autobaud minimum high pulse duration register
 */

#define UART_HIGHPULSE_REG(i) (REG_UART_BASE(i) + 0x80)

/* UART_HIGHPULSE_MIN_CNT : RO; bitpos: [11:0]; default: 4095;
 * This register stores  the value of the maxinum duration time for the high
 * level pulse. It is used in baud rate-detect process.
 */

#define UART_HIGHPULSE_MIN_CNT    0x00000fff
#define UART_HIGHPULSE_MIN_CNT_M  (UART_HIGHPULSE_MIN_CNT_V << UART_HIGHPULSE_MIN_CNT_S)
#define UART_HIGHPULSE_MIN_CNT_V  0x00000fff
#define UART_HIGHPULSE_MIN_CNT_S  0

/* UART_RXD_CNT_REG register
 * Autobaud edge change count register
 */

#define UART_RXD_CNT_REG(i) (REG_UART_BASE(i) + 0x84)

/* UART_RXD_EDGE_CNT : RO; bitpos: [9:0]; default: 0;
 * This register stores the count of rxd edge change. It is used in baud
 * rate-detect process.
 */

#define UART_RXD_EDGE_CNT    0x000003ff
#define UART_RXD_EDGE_CNT_M  (UART_RXD_EDGE_CNT_V << UART_RXD_EDGE_CNT_S)
#define UART_RXD_EDGE_CNT_V  0x000003ff
#define UART_RXD_EDGE_CNT_S  0

/* UART_CLK_CONF_REG register
 * UART core clock configuration
 */

#define UART_CLK_CONF_REG(i) (REG_UART_BASE(i) + 0x88)

/* UART_RX_RST_CORE : R/W; bitpos: [27]; default: 0;
 * Write 1 then write 0 to this bit to reset UART Rx.
 */

#define UART_RX_RST_CORE    (BIT(27))
#define UART_RX_RST_CORE_M  (UART_RX_RST_CORE_V << UART_RX_RST_CORE_S)
#define UART_RX_RST_CORE_V  0x00000001
#define UART_RX_RST_CORE_S  27

/* UART_TX_RST_CORE : R/W; bitpos: [26]; default: 0;
 * Write 1 then write 0 to this bit to reset UART Tx.
 */

#define UART_TX_RST_CORE    (BIT(26))
#define UART_TX_RST_CORE_M  (UART_TX_RST_CORE_V << UART_TX_RST_CORE_S)
#define UART_TX_RST_CORE_V  0x00000001
#define UART_TX_RST_CORE_S  26

