apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_uart.h
/* UART_RX_SCLK_EN : R/W; bitpos: [25]; default: 1;
 * Set this bit to enable UART Rx clock.
 */

#define UART_RX_SCLK_EN    (BIT(25))
#define UART_RX_SCLK_EN_M  (UART_RX_SCLK_EN_V << UART_RX_SCLK_EN_S)
#define UART_RX_SCLK_EN_V  0x00000001
#define UART_RX_SCLK_EN_S  25

/* UART_TX_SCLK_EN : R/W; bitpos: [24]; default: 1;
 * Set this bit to enable UART Tx clock.
 */

#define UART_TX_SCLK_EN    (BIT(24))
#define UART_TX_SCLK_EN_M  (UART_TX_SCLK_EN_V << UART_TX_SCLK_EN_S)
#define UART_TX_SCLK_EN_V  0x00000001
#define UART_TX_SCLK_EN_S  24

/* UART_RST_CORE : R/W; bitpos: [23]; default: 0;
 * Write 1 then write 0 to this bit to reset UART Tx/Rx.
 */

#define UART_RST_CORE    (BIT(23))
#define UART_RST_CORE_M  (UART_RST_CORE_V << UART_RST_CORE_S)
#define UART_RST_CORE_V  0x00000001
#define UART_RST_CORE_S  23

/* UART_SCLK_EN : R/W; bitpos: [22]; default: 1;
 * Set this bit to enable UART Tx/Rx clock.
 */

#define UART_SCLK_EN    (BIT(22))
#define UART_SCLK_EN_M  (UART_SCLK_EN_V << UART_SCLK_EN_S)
#define UART_SCLK_EN_V  0x00000001
#define UART_SCLK_EN_S  22

/* UART_SCLK_SEL : R/W; bitpos: [21:20]; default: 3;
 * UART clock source select. 1: 80Mhz.  2: 8Mhz.  3: XTAL.
 */

#define UART_SCLK_SEL    0x00000003
#define UART_SCLK_SEL_M  (UART_SCLK_SEL_V << UART_SCLK_SEL_S)
#define UART_SCLK_SEL_V  0x00000003
#define UART_SCLK_SEL_S  20

/* UART_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 1;
 * The integral part of the frequency divider factor.
 */

#define UART_SCLK_DIV_NUM    0x000000ff
#define UART_SCLK_DIV_NUM_M  (UART_SCLK_DIV_NUM_V << UART_SCLK_DIV_NUM_S)
#define UART_SCLK_DIV_NUM_V  0x000000ff
#define UART_SCLK_DIV_NUM_S  12

/* UART_SCLK_DIV_A : R/W; bitpos: [11:6]; default: 0;
 * The numerator of the frequency divider factor.
 */

#define UART_SCLK_DIV_A    0x0000003f
#define UART_SCLK_DIV_A_M  (UART_SCLK_DIV_A_V << UART_SCLK_DIV_A_S)
#define UART_SCLK_DIV_A_V  0x0000003f
#define UART_SCLK_DIV_A_S  6

/* UART_SCLK_DIV_B : R/W; bitpos: [5:0]; default: 0;
 * The  denominator of the frequency divider factor.
 */

#define UART_SCLK_DIV_B    0x0000003f
#define UART_SCLK_DIV_B_M  (UART_SCLK_DIV_B_V << UART_SCLK_DIV_B_S)
#define UART_SCLK_DIV_B_V  0x0000003f
#define UART_SCLK_DIV_B_S  0

/* UART_DATE_REG register
 * UART Version register
 */

#define UART_DATE_REG(i) (REG_UART_BASE(i) + 0x8c)

/* UART_DATE : R/W; bitpos: [31:0]; default: 35656288;
 * This is the version register.
 */

#define UART_DATE    0xffffffff
#define UART_DATE_M  (UART_DATE_V << UART_DATE_S)
#define UART_DATE_V  0xffffffff
#define UART_DATE_S  0

/* UART_AFIFO_STATUS_REG register
 * UART AFIFO Status
 */

#define UART_AFIFO_STATUS_REG(i) (REG_UART_BASE(i) + 0x90)

/* UART_RX_AFIFO_EMPTY : RO; bitpos: [3]; default: 1;
 * Empty signal of APB RX AFIFO.
 */

#define UART_RX_AFIFO_EMPTY    (BIT(3))
#define UART_RX_AFIFO_EMPTY_M  (UART_RX_AFIFO_EMPTY_V << UART_RX_AFIFO_EMPTY_S)
#define UART_RX_AFIFO_EMPTY_V  0x00000001
#define UART_RX_AFIFO_EMPTY_S  3

/* UART_RX_AFIFO_FULL : RO; bitpos: [2]; default: 0;
 * Full signal of APB RX AFIFO.
 */

#define UART_RX_AFIFO_FULL    (BIT(2))
#define UART_RX_AFIFO_FULL_M  (UART_RX_AFIFO_FULL_V << UART_RX_AFIFO_FULL_S)
#define UART_RX_AFIFO_FULL_V  0x00000001
#define UART_RX_AFIFO_FULL_S  2

/* UART_TX_AFIFO_EMPTY : RO; bitpos: [1]; default: 1;
 * Empty signal of APB TX AFIFO.
 */

#define UART_TX_AFIFO_EMPTY    (BIT(1))
#define UART_TX_AFIFO_EMPTY_M  (UART_TX_AFIFO_EMPTY_V << UART_TX_AFIFO_EMPTY_S)
#define UART_TX_AFIFO_EMPTY_V  0x00000001
#define UART_TX_AFIFO_EMPTY_S  1

/* UART_TX_AFIFO_FULL : RO; bitpos: [0]; default: 0;
 * Full signal of APB TX AFIFO.
 */

#define UART_TX_AFIFO_FULL    (BIT(0))
#define UART_TX_AFIFO_FULL_M  (UART_TX_AFIFO_FULL_V << UART_TX_AFIFO_FULL_S)
#define UART_TX_AFIFO_FULL_V  0x00000001
#define UART_TX_AFIFO_FULL_S  0

/* UART_REG_UPDATE_REG register
 * UART Registers Configuration Update register
 */

#define UART_REG_UPDATE_REG(i) (REG_UART_BASE(i) + 0x98)

/* UART_REG_UPDATE : R/W/SC; bitpos: [0]; default: 0;
 * Software write 1 would synchronize registers into UART Core clock domain
 * and would be cleared by hardware after synchronization is done.
 */

#define UART_REG_UPDATE    (BIT(0))
#define UART_REG_UPDATE_M  (UART_REG_UPDATE_V << UART_REG_UPDATE_S)
#define UART_REG_UPDATE_V  0x00000001
#define UART_REG_UPDATE_S  0

/* UART_ID_REG register
 * UART ID register
 */

#define UART_ID_REG(i) (REG_UART_BASE(i) + 0x9c)

/* UART_ID : R/W; bitpos: [31:0]; default: 1280;
 * This register is used to configure the uart_id.
 */

#define UART_ID    0xffffffff
#define UART_ID_M  (UART_ID_V << UART_ID_S)
#define UART_ID_V  0xffffffff
#define UART_ID_S  0

#endif /* __ARCH_RISCV_SRC_ESP32C6_HARDWARE_ESP32C6_UART_H */
